app/controllers/admin/camps_controller.rb

SELECT  "camps".* FROM "camps" WHERE (LOWER(title) LIKE '%usman%') LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT  "camps".* FROM "camps" ORDER BY "camps"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "camps"
---
  def index
    if params[:search_key]
      @camps = Camp.where(
        'LOWER(title) LIKE ?',
        "%#{params[:search_key]}%"
      ).page(params[:page])
    else
      @camps = Camp.order(sort_column + ' ' + sort_direction)
      @camps = Camp.order(:id).page(params[:page])

INSERT INTO "camps" ("created_at", "updated_at", "title", "locations", "camp_type", "camp_status", "applicant_registration_start_date", "applicant_registration_start_time", "applicant_registration_end_date", "applicant_registration_end_time", "parent_application_start_date", "parent_application_start_time", "parent_application_end_date", "parent_application_end_time") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @camp = Camp.new(camp_params)
    if @camp.save

DELETE FROM "camps" WHERE "camps"."id" = $1  [["id", 2]]
---
  def destroy
    @camp.destroy

SELECT  "camps".* FROM "camps" WHERE "camps"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def find_camp
    @camp = Camp.find(params[:id])