app/controllers/admin/users_controller.rb

SELECT  "users".* FROM "users" WHERE (LOWER(first_name) LIKE '%usman%' OR LOWER(email) LIKE '%usman%' ) LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE (LOWER(first_name) LIKE '%usman%' OR LOWER(email) LIKE '%usman%' )
SELECT  "users".* FROM "users" ORDER BY "users"."first_name" ASC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"
---
  def index

    if params[:search_key]
      @users = User.where("LOWER(first_name) LIKE ? OR LOWER(email) LIKE ? " ,
      "%#{params[:search_key]}%", "%#{params[:search_key]}%").page(params[:page])
    else
      @users = User.order(sort_column + " " + sort_direction)
      @users = User.order(:id).page(params[:page])

INSERT INTO "users" ("email", "encrypted_password", "confirmation_token", "confirmation_sent_at", "created_at", "updated_at", "first_name", "last_name", "country", "phone_number") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @user=User.new(user_params)
    if @user.save

UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "$2a$12$YCzV9uYZoJ8DWGnlr7KNeeyshUlElsb2Acw0GBTFthjNM/mnIw8NS"], ["updated_at", "2022-09-13 11:44:24.560008"], ["id", 45]]
---
	def update
		if @user.update(user_params)