app/models/user.rb

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
---
  def self.to_csv
    attributes = %w[id first_name last_name email country phone_number]

    CSV.generate(headers: true) do |csv|
      csv << attributes

      all.each do |user|
        csv << attributes.map { |attr| user.send(attr) }